{
    "last scanned block": 2051237,
    "proposals": {
        "#1": {
            "Proposal text": "My proposal: 1BCH -> Celery I propose to swap all of the 1BCH tokens (approximately 145880.67 1BCH) in the portfolio balance for additional Celery to be staked on celery.cash. I am proposing swapping the 1BCH tokens since they can no longer be staked and I personally see no purpose for holding a DEX token that is not staked for some type of profit, especially since DEX tokens seem to trend predominantly downwards over time. I'm proposing to swap for Celery for that sweet, sweet, 100% APY. The 1BCH token should be swapped it their entirety in one transaction on Mistswap.fi. Happy voting!",
            "Author": "0x0a54897fdb1c7f9499e6f06201d41a98232008ac",
            "UNIX Start time": 1638830400,
            "Start time": "2021-12-06 22:40:00",
            "Choices": {
                "ACCEPT": {
                    "TAG": "ACCEPT",
                    "Votes": 0
                },
                "REJECT": {
                    "TAG": "REJECT",
                    "Votes": 0
                }
            },
            "UNIX End time": 1639435200,
            "End time": "2021-12-13 22:40:00",
            "Open": true
        },
        "#2": {
            "Proposal text": "Take FLEX + equivalent amount of flexUSD and farm on mistswap. Gives 153% apr (for now) scheduled to increase by 36% on next rebalancing.",
            "Author": "S. Nakamario",
            "UNIX Start time": 1638865800,
            "Start time": "2021-12-07 08:30:00",
            "Choices": {
                "ACCEPT": {
                    "TAG": "ACCEPT",
                    "Votes": 0
                },
                "REJECT": {
                    "TAG": "REJECT",
                    "Votes": 0
                }
            },
            "UNIX End time": 1639470600,
            "End time": "2021-12-14 08:30:00",
            "Open": true
        },
        "#3": {
            "Proposal text": "Sell 1BCH for Celery. Sell flexUSD for equivalent amount of BCH to pair with all the Celery. Farm on mistswap. Gives 270% apr (for now) scheduled to increase by 167% on next rebalancing.",
            "Author": "S. Nakamario",
            "UNIX Start time": 1638866100,
            "Start time": "2021-12-07 08:35:00",
            "Choices": {
                "ACCEPT": {
                    "TAG": "ACCEPT",
                    "Votes": 0
                },
                "REJECT": {
                    "TAG": "REJECT",
                    "Votes": 0
                }
            },
            "UNIX End time": 1639470900,
            "End time": "2021-12-14 08:35:00",
            "Open": true
        },
        "#4": {
            "Proposal text": "This proposal will be a modification to Proposal #1 with a sped-up timeframe to get some action. Although the current APRs on farms for the 1BCH DEX are very enticing, I do not think a portfolio for what aims to be a top token on smartBCH should be heavily staked in an unproven DEX with tokenomics that are not clearly defined. A concern was raised in the telegram group about Celery being locked up for too long, so this slight modification will be to swap all 1BCH (approximately 145880.67 1BCH) in the portfolio to Celery but allow the voting to decide whether to stake the new Celery or leave it sitting dormant in the wallet to be more liquid. This will allow the Celery to possibly remain liquid and rely on future voting on whether to stake it or swap further for different coins. Money sitting in Celery will be better than money sitting in 1BCH at the very least in my opinion, whether staked or not. Let's try out voting without waiting a week! Although Proposal #1 was originally written simply to try out the proposal system, I think this proposal will be safer for the community, while also allowing for a larger variety of votes. As before, the swap from 1BCH to Celery should be done entirely in one transaction on Mistswap.fi. Let's get some votes flowing, whether for or against, I want to see how this works! Disclaimer: I <3 Celery, stop judging me.",
            "Author": "0x0a54897fdb1c7f9499e6f06201d41a98232008ac",
            "UNIX Start time": 1639037100,
            "Start time": "2021-12-09 08:05:00",
            "Choices": {
                "A": {
                    "TAG": "SWAP AND STAKE",
                    "Votes": 15000.0
                },
                "B": {
                    "TAG": "SWAP AND HOLD",
                    "Votes": 0
                },
                "C": {
                    "TAG": "REJECT",
                    "Votes": 0
                }
            },
            "UNIX End time": 1639209900,
            "End time": "2021-12-11 08:05:00",
            "Open": true
        }
    }
}